---
layout: post
status: publish
published: true
title: Задачи про злых учителей в ABC Pascal
author:
  display_name: Sergey Sazhin
  login: admin
  email: sazhin64@gmail.com
  url: ''
author_login: admin
author_email: sazhin64@gmail.com
wordpress_id: 139
wordpress_url: http://sergei-sazhin.ru/?p=139
date: '2012-02-25 10:50:15 +0600'
date_gmt: '2012-02-25 04:50:15 +0600'
categories:
- Методические разработки
tags:
- Pascal
- ABC Pascal
- Задачи
comments: []
---
<p align="center"><strong>Задачи про злых учителей.<&#47;strong><&#47;p><br />
<strong>Написать программу для решения задач в <&#47;strong><strong>ABC<&#47;strong><strong> <&#47;strong><strong>Pascal<&#47;strong><strong>. Используйте промежуточные значения для решения. Напишите более короткий вариант решения задачи. Если программа выдает вам ошибку, просто поменяйте апострофы в скобках, так как они могли поменяться при копировании из документа Word.<br />
<&#47;strong></p>
<p><strong>1. <&#47;strong>Злой учитель по математике во вторник дал 1200 примеров на деление на дом. Из них 200 примеров 1 классу, а остальное 2 классу, по 100 примеров каждому ученику. Сколько несчастных детей учится во 2 классе?<strong><&#47;strong></p>
<p><code>var x1, x2, y:real;</p>
<p>begin</p>
<p>x1:=200;</p>
<p>x2:=1200-200;</p>
<p>y:=x2&#47;100;</p>
<p>writeln('y=',y);</p>
<p>end.<&#47;code></p>
<p><strong>2.<&#47;strong> Злой учитель по физкультуре заставил учеников 3 класса делать 6000 отжиманий. За первый урок дети сделали 1&#47;5 часть от всех отжиманий. За второй урок - 1&#47;4 часть. Сколько еще уроков провели дети в спортзале, если на каждом из оставшихся они делали по 1100 отжиманий?</p>
<p><code>var y,x1,x2,x3:real;</p>
<p>begin</p>
<p>y:=6000;</p>
<p>x1:=6000&#47;5;</p>
<p>x2:=6000&#47;4;</p>
<p>x3:=(6000-x1-x2)&#47;1100;</p>
<p>writeln('x3=',x3);</p>
<p>end.<&#47;code><br />
3<&#47;strong>. Злой учитель по русскому языку устроил ученикам первого класса диктант. Когда он продиктовал детям 380 слов, оставалось в 2 раза меньше слов, чем было продиктовано. Сколько всего слов было в диктанте у злого учителя?</p>
<p><code>var x1,x2,x3:real;</p>
<p>begin</p>
<p>x1:=380;</p>
<p>x2:=380&#47;2;</p>
<p>x3:=x1+x2;</p>
<p>writeln('x3=',x3);</p>
<p>end.<&#47;code></p>
<p>&nbsp;</p>
<p><strong>4<&#47;strong>. За первые 6 уроков злой учитель по английскому языку поставил 180 двоек. Сколько двоек поставит злой учитель по английскому языку за 30 уроков, если будет ставить двойки с таким же усердием?</p>
<p><code>var x1,x2:real;</p>
<p>begin</p>
<p>x1:=180&#47;6;</p>
<p>x2:=x1*30;</p>
<p>writeln('x2=',x2);</p>
<p>end.<&#47;code><br />
5<&#47;strong>. Злой учитель по рисованию заставил учеников 5 класса нарисовать 6000 рисунков про космос. Они уже нарисовали 10 коробок с рисунками про Гагарина по 350 рисунков в каждой и 4 коробки с рисунками про Луну по 150 рисунков в каждой. Сколько еще рисунков про музей космонавтики им предстоит нарисовать?</p>
<p><code>var x1,x2:real;</p>
<p>begin</p>
<p>x1:=10*350+4*150;</p>
<p>x2:=6000-x1;</p>
<p>writeln('x2=',x2);</p>
<p>end.<&#47;code><br />
6<&#47;strong>. На уроке физкультуры у злого учителя ученики 4 класса бежали без остановки 6 часов со скоростью 10 км&#47;ч. После этого им осталось пробежать в 4 раза большее расстояние того, которое они уже пробежали. На какую дистанцию устроил разминочный забег злой учитель по физкультуре?</p>
<p><code>var x1,x2,x3:real;</p>
<p>begin</p>
<p>x1:=6*10;</p>
<p>x2:=x1*4;</p>
<p>x3:=x1+x2;</p>
<p>writeln('x3=',x3);</p>
<p>end.<&#47;code><br />
7<&#47;strong>. На педсовете учителя ругали Вову Иванова за плохое поведение и учебу. Учитель математики ругал Вову 3 минуты со скоростью 400 слов в минуту, учитель английского языка ругал 5 минут со скоростью 200 слов в минуту на русском языке и 10 минут со скоростью 600 слов в минуту на английском языке. Сколько всего слов в свой адрес услышал Вова Иванов?</p>
<p><code>var x1,x2,x3:real;</p>
<p>begin</p>
<p>x1:=3*400;</p>
<p>x2:=5*200+10*600;</p>
<p>x3:=x1+x2;</p>
<p>writeln('x3=',x3);</p>
<p>end.<&#47;code><br />
8<&#47;strong>. Два ученика 1 класса испугались злого учителя по труду и побежали от него одновременно, но в противоположных направлениях. Первый ученик бежал 3 часа со скоростью 8 км&#47;ч, а второй ученик - 4 часа со скоростью 7 км&#47;ч. На каком расстоянии друг от друга они оказались?</p>
<p><code>var x1,x2,x3:real;</p>
<p>begin</p>
<p>x1:=3*8;</p>
<p>x2:=4*7;</p>
<p>x3:=x1+x2;</p>
<p>writeln('x3=',x3);</p>
<p>end.<&#47;code><br />
9. <&#47;strong>Злой учитель по музыке заставил учеников 3 класса спеть 416 песен за 8 минут. Затем он заставил детей увеличить скорость пения на 4 песни в минуту и пропел с ними еще 6 минут. Сколько всего песен заставил cпеть злой учитель по музыке?</p>
<p><code>var x1,x2,x3,x4:real;</p>
<p>begin</p>
<p>x1:=416&#47;8;</p>
<p>x2:=x1+4;</p>
<p>x3:=x2*6;</p>
<p>x4:=416+x3;</p>
<p>writeln('x4=',x4);</p>
<p>end.<&#47;code><br />
10<&#47;strong>. Два второклассника бежали от злого учителя по русскому языку в противоположных направлениях. Через три часа бега расстояние между ними было 27 км. Первый второклассник бежал со скоростью 5 км&#47;ч. С какой скоростью бежал второй ученик?</p>
<p><code>var x1:real;</p>
<p>begin</p>
<p>x1:=(27-15)&#47;3;</p>
<p>writeln('x1=',x1);</p>
<p>end.<&#47;code></p>
