---
layout: post
status: publish
published: true
title: Пятью пять - двадцать пять!
author:
  display_name: Sergey Sazhin
  login: admin
  email: sazhin64@gmail.com
  url: ''
author_login: admin
author_email: sazhin64@gmail.com
wordpress_id: 1128
wordpress_url: http://sergei-sazhin.ru/?p=1128
date: '2012-05-15 11:21:53 +0600'
date_gmt: '2012-05-15 05:21:53 +0600'
categories:
- Решение олимпиадных задач
tags:
- ABC Pascal
- Задачи
- олимпиадные
comments: []
---
<p>(Время: 1 сек. Память: 16 Мб Сложность: 8%)<br />
Вася и Петя учатся в школе в одном классе. Недавно Петя поведал Васе о хитром способе возведения в квадрат натуральных чисел, оканчивающихся на цифру 5. Теперь Вася может с легкостью возводить в квадрат двузначные (и даже некоторые трехзначные) числа, оканчивающиеся на 5. Способ заключается в следующем: для возведения в квадрат числа, оканчивающегося на 5 достаточно умножить число, полученное из исходного вычеркиванием последней пятерки на следующее по порядку число, затем остается лишь приписать &laquo;25&raquo; к получившемуся результату справа. Например, для того, чтобы возвести число 125 в квадрат достаточно 12 умножить на 13 и приписать 25, т.е. приписывая к числу 12*13=156 число 25, получаем результат 15625, т.е. 1252=15625. Напишите программу, возводящую число, оканчивающееся на 5, в квадрат для того, чтобы Вася смог проверить свои навыки.<br />
Входные данные В единственной строке входного файла INPUT.TXT записано одно натуральное число А, оканчивающееся на цифру 5, не превышающее 4*105.<br />
Выходные данные В выходной файл OUTPUT.TXT выведите одно натуральное число - A2 без лидирующих нулей.<br />
№	INPUT.TXT	OUTPUT.TXT<br />
1	5	25<br />
2	75	5625<br />
3	4255	18105025</p>
<p>Решение:<br />
<code>var<br />
  a,b: integer;<br />
  f: text;<br />
begin<br />
  read(a);<br />
  assign(f, 'F:&#47;input.txt');<br />
  rewrite(f);<br />
  writeln(f, a);<br />
  close(f);<br />
  assign(f, 'F:&#47;output.txt');<br />
  rewrite(f);<br />
  b:= a div 10;<br />
  write(f,b*(b+1),25);<br />
  close(f);<br />
end.<&#47;code><br />
При создании программы не забудьте про правильность имен файлов. Я создавал папку на съемном носителе с меткой F:&#47;<br />
<a href="http:&#47;&#47;sergei-sazhin.ru&#47;wp-content&#47;uploads&#47;2012&#47;05&#47;vosvedenie-v-kvadrat-chisla-c-5.7z">Скачать программу<&#47;a></p>
