---
layout: post
status: publish
published: true
title: Сумма
author:
  display_name: Sergey Sazhin
  login: admin
  email: sazhin64@gmail.com
  url: ''
author_login: admin
author_email: sazhin64@gmail.com
wordpress_id: 1122
wordpress_url: http://sergei-sazhin.ru/?p=1122
date: '2012-05-15 11:08:59 +0600'
date_gmt: '2012-05-15 05:08:59 +0600'
categories:
- Решение олимпиадных задач
tags:
- Задачи
- олимпиадные
comments: []
---
<p>Дана задача:<br />
Сумма<br />
(Время: 1 сек. Память: 16 Мб Сложность: 19%)<br />
Требуется посчитать сумму целых чисел от 1 до N.<br />
Входные данные В единственной строке входного файла INPUT.TXT записано единственное целое число N, не превышающее по абсолютной величине 104.<br />
Выходные данные В единственную строку выходного файла OUTPUT.TXT нужно вывести одно целое число &mdash; сумму чисел от 1 до N. Пример<br />
№	INPUT.TXT	OUTPUT.TXT<br />
1	5	15<br />
Решение на языке Pascal ABC<br />
<code>var a, b : longint;<br />
f,f1:text;<br />
begin<br />
  assign(f, 'C:\Users\ученик&#47;input.txt'); reset(f);<br />
  assign(f1, 'C:\Users\ученик&#47;output.txt'); rewrite(f1);<br />
  read(f,a, b);<br />
  writeln(f1,a+b);<br />
  close(f);<br />
  close(f1);<br />
end.<&#47;code><br />
Внимание! Когда вы будете писать код, не забудьте, что ваши файлы будут иметь собственные имена, отличающиеся от моих. Чтобы правильно написать имя файла, нажмите правой кнопкой мыши, зайдите в свойства и скопируйте путь к файлу. Лучше всего, если вы создадите отдельную папку для проекта и все файлы будете создавать в ней.<br />
<a href="http:&#47;&#47;sergei-sazhin.ru&#47;wp-content&#47;uploads&#47;2012&#47;05&#47;a+b.7z">Скачать программу<&#47;a></p>
